src/DataProcessors/ирИсторияГита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ирИсторияГита</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьКонцыСтрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПапкаГита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогСхожести</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоСтрокКонтекста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Коммиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ветки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейОтРодителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коммит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родители</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Слияние</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файлов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыКоммита</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДобавленоСтрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРодителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдаленоСтрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ирИсторияГита/Forms/ИзмененныеМодули/Ext/Form/Module.bsl
Перем РасширениеФайлаМодуля;
Перем мИсторияГита; // другой экземпляр чтобы не сломать открытую основную форму
Перем мПолеТекстаПоиска;
Перем мПолеТекстаПрограммы;
Перем мНачальнаяСтрока Экспорт; 

Процедура ПриОткрытии()
	мПлатформа.ЗагрузитьКэшМодулейВПамятьОС();
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	ирКлиент.ИмяФайлаМодуляВПапкеГитаЛкс("", ПапкаГита); // Чтобы настройки Гита открылись
	Если Не ЗначениеЗаполнено(ПапкаГита) Тогда
		Возврат;
	КонецЕсли;
	ирКлиент.ДопСвойстваЭлементаФормыЛкс(ЭтаФорма, ЭлементыФормы.ИзмененныеМодули).МенеджерПоиска = ирКлиент.СоздатьМенеджерПоискаВТабличномПолеЛкс(Новый Структура("Текст")); // Для отключения раскраски
	ЭтаФорма.ДатаОбновленияКэша = ирОбщий.ДатаОбновленияКэшаМодулейЛкс();
	мИсторияГита = ирКлиент.ПолучитьФормуЛкс("Обработка.ирИсторияГита.Форма",,, "ИзмененияКэшаМодулей");
	мИсторияГита.ПапкаГита = ПапкаГита;
	мПолеТекстаПоиска = ирКлиент.ОболочкаПоляТекстаЛкс(ЭлементыФормы.ИзмененияФайла);
	// Без установки непустого текста не будет события ДокументСформирован и подключения обработчиков событий и будет криво отображаться контекстное меню https://www.hostedredmine.com/issues/1008133
	мПолеТекстаПоиска.УстановитьТекст("_"); 
	мИсторияГита.мПолеТекстаПоиска = мПолеТекстаПоиска;
	мПолеТекстаПрограммы = ирОбщий.НовыйАнализаторКодаЛкс();
	ЭтаФорма.СтруктураОтличий = мИсторияГита.СтруктураОтличий;
	ЭтаФорма.ЭлементыФормы.НадписьПоследнийКоммит.Заголовок = ДатаПоследнегоКоммита();
	ПодключитьОбработчикОжидания("ПриОткрытииОтложенно", 0.1, Истина); // - 0.1 не хватает при открытии из Турбоконфа
КонецПроцедуры

Процедура ПриОткрытииОтложенно()
	ОбновитьДанные();
КонецПроцедуры

Процедура ОбновитьДанные() Экспорт
	Если Не ЗначениеЗаполнено(ПапкаГита) Тогда
		Возврат;
	КонецЕсли;
	ТабличноеПолеСостояние = ирКлиент.ТабличноеПолеСостояниеСтрокЛкс(ЭлементыФормы.ИзмененныеМодули, "Модуль"); /// Нельзя делать рекурсивно, т.к. модули расширений смогут перекрывать оригиналы
	ИзмененныеМодули.Очистить();
	ФайлыМодулейКэша = НайтиФайлы(мПлатформа.ПапкаКэшаМодулей.ПолноеИмя, "*." + РасширениеФайлаМодуля);
	ТекстовыйДокументНовый = Новый ТекстовыйДокумент;
	ТекстовыйДокументСтарый = Новый ТекстовыйДокумент;
	Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ФайлыМодулейКэша.Количество(), "Анализ файлов");
	ПроверенныеМодулиГита = Новый Соответствие;
	Для Каждого Файл Из ФайлыМодулейКэша Цикл
		ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
		ФайлГита = Новый файл(ирКлиент.ИмяФайлаМодуляВПапкеГитаЛкс(Файл.ИмяБезРасширения, ПапкаГита));
		Если Не ФайлГита.Существует() Тогда
			Продолжить;
		КонецЕсли; 
		ПроверенныеМодулиГита[ФайлГита.ПолноеИмя] = 1;
		ТекстовыйДокументНовый.Прочитать(Файл.ПолноеИмя, КодировкаТекста.UTF8);
		ТекстовыйДокументСтарый.Прочитать(ФайлГита.ПолноеИмя, КодировкаТекста.UTF8);
		СтарыйТекст = ТекстовыйДокументСтарый.ПолучитьТекст();
		Если СтарыйТекст = ТекстовыйДокументНовый.ПолучитьТекст() Тогда
			Продолжить;
		КонецЕсли;
		СтрокаМодуля = ИзмененныеМодули.Добавить();
		СтрокаМодуля.Модуль = Файл.ИмяБезРасширения;
		СтрокаМодуля.ФайлГита = ФайлГита.ПолноеИмя;
		СтрокаМодуля.ФайлКэша = Файл.ПолноеИмя;
		СтрокаМодуля.ДатаИзмененияКэша = Файл.ПолучитьВремяИзменения();
		СтрокаМодуля.ДатаИзмененияГита = ФайлГита.ПолучитьВремяИзменения();
		СтрокаМодуля.ГитНовее = СтрокаМодуля.ДатаИзмененияГита > СтрокаМодуля.ДатаИзмененияКэша;
		Если СтрокаМодуля.Модуль = ПараметрИмяТекущегоМодуля Тогда
			ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока = СтрокаМодуля;
			ТабличноеПолеСостояние = Неопределено;
		КонецЕсли;
	КонецЦикла;
	ФайлыМодулейГита = НайтиФайлы(ПапкаГита, "*.bsl", Истина);
	Для Каждого Файл Из ФайлыМодулейГита Цикл
		Если Ложь
			Или ПроверенныеМодулиГита[Файл.ПолноеИмя] <> Неопределено 
			Или Файл.Размер() = 0
		Тогда
			Продолжить;
		КонецЕсли;
		СтрокаМодуля = ИзмененныеМодули.Добавить();
		СтрокаМодуля.ФайлГита = Файл.ПолноеИмя;
		ФайлКэша = ирКлиент.ФайлКэшаМодуляИзФайлаГитаЛкс(Файл, ПапкаГита, СтрокаМодуля.Модуль);
		СтрокаМодуля.ФайлКэша = ФайлКэша.ПолноеИмя;
		СтрокаМодуля.ГитНовее = Истина;
		СтрокаМодуля.ДатаИзмененияГита = Файл.ПолучитьВремяИзменения();
	КонецЦикла;
	ИзмененныеМодули.Сортировать("Модуль");
	ЭтаФорма.ПараметрИмяТекущегоМодуля = "";
	ЭтаФорма.Количество = ИзмененныеМодули.Количество();
	ирОбщий.ОсвободитьИндикаторПроцессаЛкс();
	Если ТабличноеПолеСостояние <> Неопределено Тогда
		ирКлиент.ТабличноеПолеВосстановитьСостояниеСтрокЛкс(ЭлементыФормы.ИзмененныеМодули, ТабличноеПолеСостояние);
	КонецЕсли;
	//ПодключитьОбработчикОжидания("ОбновитьДатыКоммитов", 0.1, Истина);
КонецПроцедуры

Процедура ОбновитьДатыКоммитов() Экспорт
	//Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ИзмененныеМодули.Количество(), "Даты изменения Гита");
	//Для Каждого СтрокаМодуля Из ИзмененныеМодули Цикл
	//	ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
	//	СтрокаМодуля.ДатаИзмененияГита = мИсторияГита.ДатаПоследнегоКоммита(СтрокаМодуля.ФайлГита);
	//КонецЦикла;
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Функция ТекстФайлаСтроки(Знач ВыбраннаяСтрока = Неопределено)
	Если ВыбраннаяСтрока = Неопределено Тогда
		ВыбраннаяСтрока = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	КонецЕсли;
	ФайлМодуля = мПлатформа.ФайлМодуляИзИмениМодуля(ВыбраннаяСтрока.Модуль);
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ФайлМодуля.ПолноеИмя);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	Возврат ТекстФайла;
КонецФункции

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	ирКлиент.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка) Экспорт
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
КонецПроцедуры

Процедура НадписьКэшМодулейНажатие(Элемент)
	мПолеТекстаПрограммы.ПолучитьФорму("Настройки").Открыть();
КонецПроцедуры

Процедура ИзмененныеМодулиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Ложь
		Или Колонка = Элемент.Колонки.ФайлГита 
		Или Колонка = Элемент.Колонки.ФайлКэша 
	Тогда
		ирКлиент.ОткрытьФайлВПроводникеЛкс(ВыбраннаяСтрока[Колонка.Данные]);
	Иначе
		КПРезультатыПоискаСравнитьВСравнителеТекстов();
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыОткрытьВКонфигураторе(Кнопка)
	Строка = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ссылка = ирКлиент.СсылкаНаМодульКонфигурацииЛкс(Строка.Модуль);
	ирКлиент.ОткрытьСсылкуВКонфигуратореЛкс(Ссылка);
КонецПроцедуры

Процедура КПРезультатыПоискаОткрытьВКонфигураторе(Кнопка)
	СтрокаФайла = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	Если СтрокаФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ссылка = СсылкаНаСтрокуАктуальнойВерсии();
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ирКлиент.ОткрытьСсылкуСтрокиМодуляЛкс(Ссылка) Тогда 
		ПолеТекстаЛ = ирКлиент.ОткрытьПолеТекстаМодуляКонфигурацииЛкс(СтрокаФайла.Модуль);
		Если ПолеТекстаЛ <> Неопределено Тогда
			ПолеТекстаЛ.ПерейтиПоСсылкеСтрокиМодуля(Ссылка, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СсылкаНаСтрокуАктуальнойВерсии() Экспорт
	СтрокаФайла = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	Если СтрокаФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	НомерСтрокиМодуля = Макс(1, мИсторияГита.НомерСтрокиВМодуле());
	ПолеТекстаМодуля = ирКэш.ПолеТекстаМодуляЛкс(СтрокаФайла.Модуль);
	ПолеТекстаМодуля.УстановитьГраницыВыделения(НомерСтрокиМодуля, 1, НомерСтрокиМодуля, 1, Истина);
	ПолеТекстаМодуля.РазобратьТекущийКонтекст();
	Ссылка = ПолеТекстаМодуля.СсылкаСтрокиМодуля(НомерСтрокиМодуля);
	Возврат Ссылка;
КонецФункции

Процедура ДействияФормыЗаменитьМодуль(Кнопка)
	Для Каждого Строка Из ЭлементыФормы.ИзмененныеМодули.ВыделенныеСтроки Цикл
		мПолеТекстаПрограммы.УстановитьВерсиюГитаВФайлКэшаМодулей(Строка);
	КонецЦикла;
КонецПроцедуры

Процедура ИзмененныеМодулиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ОформлениеСтроки.Ячейки.ФайлГита.УстановитьТекст("<Открыть>");
	ОформлениеСтроки.Ячейки.ФайлКэша.УстановитьТекст("<Открыть>");
	ирКлиент.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки);
КонецПроцедуры

Процедура ПапкаГитаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Элемент.Значение);
КонецПроцедуры

Процедура ИзмененныеМодулиПриАктивизацииСтроки(Элемент = Неопределено)
	Элемент = ЭлементыФормы.ИзмененныеМодули;
	ирКлиент.ТабличноеПолеПриАктивизацииСтрокиЛкс(ЭтаФорма, Элемент);
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элемент.ТекущаяСтрока.ДатаИзмененияКэша) Тогда
		мИсторияГита.ОтображатьКонцыСтрок = ОтображатьКонцыСтрок;
		мИсторияГита.ЧислоСтрокКонтекста = ЧислоСтрокКонтекста;
		мИсторияГита.ТекстИзмененийФайла = ирОбщий.ВыполнитьКомандуОСЛкс(НачалоКомандыГита() + "diff --no-index --no-prefix " + мИсторияГита.ПараметрыВыводаИзмененийДляКоманды()
			+ " """ + ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока.ФайлГита + """ """ + Элемент.ТекущаяСтрока.ФайлКэша + """",,,,, КодировкаТекста.UTF8,, Не ОтображатьКонцыСтрок);
		мИсторияГита.ТекстИзмененийФайла = "@@" + ирОбщий.ТекстБезПервогоФрагментаЛкс(мИсторияГита.ТекстИзмененийФайла, "@@");
		ТекстКэшаМодуля = ирОбщий.ПрочитатьТекстИзФайлаЛкс(Элемент.ТекущаяСтрока.ФайлКэша);
	Иначе
		мИсторияГита.ТекстИзмененийФайла = "";
		ТекстКэшаМодуля = "";
	КонецЕсли;
	Если Истина
		И ПараметрИмяМодуля = Элемент.ТекущаяСтрока.Модуль
		И мНачальнаяСтрока > 0
	Тогда
		мИсторияГита.ПараметрНомерСтроки = мНачальнаяСтрока;
	КонецЕсли;
	мИсторияГита.ОбновитьПоискВТекстеФайла(, Истина, ТекстКэшаМодуля);
	мИсторияГита.АктивироватьБлокИзТекста(ЭлементыФормы.СтруктураОтличий);
КонецПроцедуры

Процедура ДействияФормыОбновить(Кнопка)
	ОбновитьДанные();
КонецПроцедуры

Процедура ДействияФормыОткрытьФайлГитаВVSCode(Кнопка)
	ТекущаяСтрока = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	мПолеТекстаПрограммы.ОткрытьМодульВГите(ТекущаяСтрока.Модуль);
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("ПриОткрытииОтложенно", 0.1, Истина); // - 0.1 не хватает при открытии из Турбоконфа
КонецПроцедуры

Процедура ДействияФормыОткрытьИсториюГита(Кнопка)
	Если ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрИмяМодуля = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока.Модуль;
	ирКлиент.ОткрытьИсториюГитаЛкс(, ПараметрИмяМодуля);
КонецПроцедуры

Процедура КПРезультатыПоискаСравнитьВСравнителеТекстов(Кнопка = Неопределено)
	ВыбраннаяСтрока = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	ТекстовыйДокументНовый = Новый ТекстовыйДокумент;
	ТекстовыйДокументСтарый = Новый ТекстовыйДокумент;
	ТекстовыйДокументНовый.Прочитать(ВыбраннаяСтрока.ФайлКэша, КодировкаТекста.UTF8);
	ТекстовыйДокументСтарый.Прочитать(ВыбраннаяСтрока.ФайлГита, КодировкаТекста.UTF8);
	ПараметрНомерСтроки = 0;
	Если Истина
		И ПараметрИмяМодуля = ВыбраннаяСтрока.Модуль 
		И мНачальнаяСтрока > 0
	Тогда
		ПараметрНомерСтроки = мНачальнаяСтрока;
		мНачальнаяСтрока = 0;
	Иначе
		ПараметрНомерСтроки = мИсторияГита.НомерСтрокиВМодуле();
	КонецЕсли;
	ЗаголовокСтороны2 = мПлатформа.ЗаголовокСтороныМодуляКонфигуратора(); 
	ирКлиент.Сравнить2ЗначенияВФормеЛкс(ТекстовыйДокументСтарый, ТекстовыйДокументНовый,, "Гит (старый)", ЗаголовокСтороны2,,, ВыбраннаяСтрока.Модуль,, "ВстроенныйЯзык", ВыбраннаяСтрока.Модуль,,,, ПараметрНомерСтроки);
КонецПроцедуры

Процедура ОтображатьКонцыСтрокПриИзменении(Элемент)
	ИзмененныеМодулиПриАктивизацииСтроки();
КонецПроцедуры

Процедура ЧислоСтрокКонтекстаПриИзменении(Элемент)
	ИзмененныеМодулиПриАктивизацииСтроки();
КонецПроцедуры

Процедура СтруктураОтличийПриАктивизацииСтроки(Элемент)
	мИсторияГита.СтруктураОтличийПриАктивизацииСтроки(Элемент);
КонецПроцедуры

Процедура ИзмененияФайлаonclick(Элемент, pEvtObj)
	мИсторияГита.АктивироватьБлокИзТекста(ЭлементыФормы.СтруктураОтличий);
КонецПроцедуры

Процедура ИзмененияФайлаДокументСформирован(Элемент)
	мИсторияГита.АктивироватьБлокИзТекста(ЭлементыФормы.СтруктураОтличий);
КонецПроцедуры

Процедура ДействияФормыОткрытьОбъектМетаданных(Кнопка)
	СтрокаТаблицы = ЭлементыФормы.ИзмененныеМодули.ТекущаяСтрока;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолноеИмяМД = ирКлиент.ПолноеИмяМДИзИмениМодуляЛкс(СтрокаТаблицы.Модуль);
	ирКлиент.ОткрытьОбъектМетаданныхЛкс(ПолноеИмяМД);
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирИсторияГита.Форма.ИзмененныеМодули");
#Если Сервер И Не Сервер Тогда
	мПолеТекстаПоиска = Обработки.ирОболочкаПолеТекста.Создать();
	мПолеТекстаПрограммы = Обработки.ирКлсПолеТекстаПрограммы.Создать();
	мПлатформа = Обработки.ирПлатформа.Создать();
#КонецЕсли 
РасширениеФайлаМодуля = "txt";
